export const coffeeWithCinnamonMessage = (): string => {
  const messages = [
    'Вітаю! Сьогоднішній день вартий того, щоб розпочати його з чашечки кави з корицею. ☕️🌿',
    'Хей! Забув про щоденну порцію кави з корицею? Не треба втрачати цей чудовий привід для задоволення! ☕️🍂',
    'Доброго ранку! Поринь у світ чарівного смаку з кавою з корицею. Почни день з ароматом задоволення! ☕️✨',
    'Поганий настрій? Не відомо що робити? Випий каву з корицею та отримай заряд позитиву! ☕️💫',
    'Хей! Сьогодні - чудовий день для кави з корицею. Зроби собі приємне! ☕️😌',
    'Доброго ранку! Поки ти читаєш це повідомлення, чашка кави з корицею вже чекає на тебе. Насолоджуйся кожним ковтком! ☕️🍁',
    'Доброго ранку! Почни день з енергійного початку - випий каву з корицею! Заряджайся позитивом і готуйся до досягнень! ☕️💪',
    'Привіт! Сьогоднішній день обіцяє бути насиченим та яскравим. Почни його з випитою кавою з корицею та позитивним настроєм! ☀️☕️',
    'Чудового ранку! Пам’ятайте, що кава з корицею - це чудовий спосіб розпочати день з енергією та насолодою. Приготуйте собі чашку і насолоджуйтесь кожним ковтком! ☕️✨',
    'Доброго ранку! Перед вами чудовий день, але щоб його розпочати на правильній ноті, не забудьте насолодитися кавою з корицею. Цей витончений поєднання смаків додасть вашому ранку більше барв та енергії! ☕️🍂',
    'Доброго ранку! Сьогоднішній ранок - чудова нагода засмакувати каву з корицею. Її аромат і смак зігріють ваші сенсори і додадуть позитивних емоцій вашому дню. Пориньте у цей смачний світ! ☕️🍂',
  ];
  const randomIndex = Math.floor(Math.random() * messages.length);
  return messages[randomIndex];
};
